In [1]:
import pandas as pd
from sqlalchemy import create_engine
from datetime import datetime
from datetime import timedelta
from config import password
password = password

In [2]:
transportData = "Refrigerated_Truck_Rates_and_Availability_Full.csv"
AvoTransportData = "Refrigerated_Truck_Rates_and_Availability_Avo.csv"
avo_data = "avo_prices.csv"
gas_data = "gas_prices.csv"
loadweather = "SanDiegoWeatherData.csv"
bananaprices = "banana_prices.csv"

In [3]:
banana_prices_df = pd.read_csv(bananaprices)
# banana_prices_df.head()

In [4]:
initSDweather_df = pd.read_csv(loadweather)
# initSDweather_df

In [5]:
initial_transport_df = pd.read_csv(transportData)
# initial_transport_df.head()

In [6]:
initial_avo_transport_df = pd.read_csv(AvoTransportData)
# initial_avo_transport_df.head()

In [7]:
avo_data_df = pd.read_csv(avo_data)
# avo_data_df.head()

In [8]:
gas_data_df = pd.read_csv(gas_data)
# gas_data_df.head()

In [9]:
# Create a filtered dataframe from specific columns
tot_transport_columns = ["Date", "Origin", "Destination", "Distance", "Commodity", "Week Low", "Week High", "Midpoint", "Rate Per Mile", "Availability"]
tot_transport_df = initial_transport_df[tot_transport_columns].copy()

# Rename the column headers
tot_transport_df = tot_transport_df.rename(columns={"Date": "date",
                                                        "Origin": "origin",
                                                        "Destination": "destination",
                                                       "Distance": "transport_distance",
                                                       "Commodity": "commodity",
                                                       "Week Low": "low_weekly_rate",
                                                       "Week High": "high_weekly_rate",
                                                       "Midpoint": "average_weekly_rate",
                                                       "Rate Per Mile": "avg_rate_per_mile_ratio",
                                                       "Availability": "availability_score"
                                                   })

# tot_transport_df.head()

In [10]:
tot_transport_df['date'] = pd.to_datetime(tot_transport_df['date'])
# tot_transport_df

tot_transport_df['date'] = tot_transport_df['date'] - timedelta(days=1)
# tot_transport_df

In [11]:
# Create a filtered dataframe from specific columns
avo_transport_columns = ["Date", "Origin", "Destination", "Distance", "Commodity", "Week Low", "Week High", "Midpoint", "Rate Per Mile", "Availability"]
avo_transport_df = initial_avo_transport_df[avo_transport_columns].copy()

# Rename the column headers
avo_transport_df = avo_transport_df.rename(columns={"Date": "date",
                                                        "Origin": "origin",
                                                        "Destination": "destination",
                                                       "Distance": "transport_distance",
                                                       "Commodity": "commodity",
                                                       "Week Low": "low_weekly_rate",
                                                       "Week High": "high_weekly_rate",
                                                       "Midpoint": "average_weekly_rate",
                                                       "Rate Per Mile": "avg_rate_per_mile_ratio",
                                                       "Availability": "availability_score"
                                                   })

# avo_transport_df.head()

In [12]:
avo_transport_df['date'] = pd.to_datetime(avo_transport_df['date'])
# avo_transport_df

avo_transport_df['date'] = avo_transport_df['date'] - timedelta(days=2)
# avo_transport_df

In [13]:
avo_transport_df['date'] = avo_transport_df['date'].dt.strftime('%m/%d/%Y')
tot_transport_df['date'] = tot_transport_df['date'].dt.strftime('%m/%d/%Y')

In [14]:
avo_transport_df.to_csv("avo_transport_df.csv", index=False, header=True)
tot_transport_df.to_csv("tot_transport_df.csv", index=False, header=True)

In [14]:
# Create a filtered dataframe from specific columns
avo_columns = ["New Date", "AveragePrice", "Total Volume", "4046", "4225", "4770", "type", "year", "region"]
avo_transformed_df = avo_data_df[avo_columns].copy()

# Rename the column headers
avo_transformed_df = avo_transformed_df.rename(columns={"New Date": "date",
                                                        "AveragePrice": "average_price",
                                                        "Total Volume": "total_volume",
                                                       "4046": "small_avocados_sold",
                                                       "4225": "large_avocados_sold",
                                                       "4770": "xl_avocados_sold",
                                                       "type": "type",
                                                       "year": "year",
                                                       "region": "region"})

# avo_transformed_df.head()

In [15]:
# Create a filtered dataframe from specific columns
gas_columns = ["Date", "Gasoline - All Grades", "Regular", "Midgrade", "Premium", "Diesel (On-Highway) - All Types"]
gas_transformed_df = gas_data_df[gas_columns].copy()

# Rename the column headers
gas_transformed_df = gas_transformed_df.rename(columns={"Date": "date",
                                                        "Gasoline - All Grades": "gas_all_grades",
                                                        "Regular": "regular",
                                                        "Midgrade": "midgrade",
                                                        "Premium": "premium",
                                                        "Diesel (On-Highway) - All Types": "diesel"})

# gas_transformed_df.head()

In [16]:
# Ensure dates have the same formatting
avo_transformed_df['date'] = pd.to_datetime(avo_transformed_df.date)
gas_transformed_df['date'] = pd.to_datetime(gas_transformed_df.date)

avo_transformed_df['date'] = avo_transformed_df['date'].dt.strftime('%m/%d/%Y')
gas_transformed_df['date'] = gas_transformed_df['date'].dt.strftime('%m/%d/%Y')

# gas_transformed_df.head()

In [17]:
# Filter data based on region and type
avo_transformed_df = avo_transformed_df.loc[avo_transformed_df['region'] == 'TotalUS']
avo_transformed_df = avo_transformed_df.loc[avo_transformed_df['type'] == 'conventional']
# from datetime import datetime, timedelta

# for date in avo_transformed_df['date']:
#     date += timedelta(days=1)
# avo_transformed_df.head(3)

In [18]:
ban_columns = ["Date", "Banana Price per Pound", "Percent Change"]
bananas_df = banana_prices_df[ban_columns].copy()

# Rename the column headers
bananas_df = bananas_df.rename(columns={"Date": "date",
                                        "Banana Price per Pound": "price_per_pound",
                                        "Percent Change": "percent_change",
                                        })

# bananas_df.head()

In [19]:
SDweather_df = initSDweather_df[["dt", "temp", "rain_1h", "rain_3h", "snow_1h", "snow_3h", "weather_description"]]
# SDweather_df

In [20]:
SDweather_df["dt"] = pd.to_datetime(SDweather_df["dt"], unit="s")
# SDweather_df

<ipython-input-20-782439be5ac4>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  SDweather_df["dt"] = pd.to_datetime(SDweather_df["dt"], unit="s")

In [21]:
SDweather_df['date'] = [d.date() for d in SDweather_df['dt']]
SDweather_df['time'] = [d.time() for d in SDweather_df['dt']]
# SDweather_df

<ipython-input-21-b030127bf400>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  SDweather_df['date'] = [d.date() for d in SDweather_df['dt']]
<ipython-input-21-b030127bf400>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  SDweather_df['time'] = [d.time() for d in SDweather_df['dt']]

In [22]:
weather_columns = ["date", "temp", "rain_1h", "rain_3h", "snow_1h", "snow_3h", "weather_description"]
sanDiegoWeather_df = SDweather_df[weather_columns].copy()
# sanDiegoWeather_df

In [24]:
avo_transformed_df = avo_transformed_df.dropna()
gas_transformed_df = gas_transformed_df.dropna()
tot_transport_df = tot_transport_df.dropna()
avo_transport_df = avo_transport_df.dropna()
bananas_df = bananas_df.dropna()
sanDiegoWeather_df = sanDiegoWeather_df.dropna()

In [25]:
# Create database connection
connection_string = (f"postgres:{password}@localhost:5432/avocado_db")
engine = create_engine(f'postgresql://{connection_string}')

In [26]:
avo_transformed_df.to_sql(name='avocado', con=engine, if_exists='append', index=False)
gas_transformed_df.to_sql(name='gas', con=engine, if_exists='append', index=False)

In [27]:
tot_transport_df.to_sql(name='tot_transport', con=engine, if_exists='append', index=False)
avo_transport_df.to_sql(name='avo_transport', con=engine, if_exists='append', index=False)

In [28]:
bananas_df.to_sql(name='banana_prices', con=engine, if_exists='append', index=False)

In [29]:
sanDiegoWeather_df.to_sql(name='san_diego', con=engine, if_exists='append', index=False)

In [30]:
pd.read_sql_query('select * from avocado', con=engine).head()

,date,average_price,total_volume,small_avocados_sold,large_avocados_sold,xl_avocados_sold,type,year,region
0,2015-01-05,0.95,31324277.73,12357161.34,13624083.05,844093.32,conventional,2015,TotalUS
1,2015-01-12,1.01,29063542.75,11544810.53,12134773.38,866574.66,conventional,2015,TotalUS
2,2015-01-19,1.03,29043458.85,11858139.34,11701947.80,831301.90,conventional,2015,TotalUS
3,2015-01-26,1.04,28470310.84,12167445.03,10734652.82,768020.05,conventional,2015,TotalUS
4,2015-02-02,0.89,44655461.51,18933038.04,18956479.74,1381516.11,conventional,2015,TotalUS

In [31]:
pd.read_sql_query('select * from gas', con=engine).head()

         date  gas_all_grades  regular  midgrade  premium  diesel
0  1994-11-28           1.117    1.105     1.197    1.303   1.126
1  1994-12-05           1.127    1.103     1.197    1.301   1.123
2  1994-12-12           1.131    1.095     1.188    1.288   1.114
3  1994-12-19           1.134    1.087     1.179    1.279   1.109
4  1994-12-26           1.125    1.077     1.171    1.270   1.106

In [32]:
pd.read_sql_query('select * from tot_transport', con=engine).head()

,date,origin,destination,transport_distance,commodity,low_weekly_rate,high_weekly_rate,average_weekly_rate,avg_rate_per_mile_ratio,availability_score
0,2020-01-06,"Imperial, Palo Verde And Coachella Valleys, Ca...",ATLANTA,2100,"LETTUCE, BROCCOLI, CAULIFLOWER, ROMAINE AND LE...",5000,5400,5200,2.48,5
1,2020-01-06,"Imperial, Palo Verde And Coachella Valleys, Ca...",BALTIMORE,2600,"LETTUCE, BROCCOLI, CAULIFLOWER, ROMAINE AND LE...",6400,6800,6600,2.54,5
2,2020-01-06,"Imperial, Palo Verde And Coachella Valleys, Ca...",BOSTON,2900,"LETTUCE, BROCCOLI, CAULIFLOWER, ROMAINE AND LE...",7300,7800,7550,2.60,5
3,2020-01-06,"Imperial, Palo Verde And Coachella Valleys, Ca...",CHICAGO,2030,"LETTUCE, BROCCOLI, CAULIFLOWER, ROMAINE AND LE...",4700,5200,4950,2.44,5
4,2020-01-06,"Imperial, Palo Verde And Coachella Valleys, Ca...",DALLAS,1300,"LETTUCE, BROCCOLI, CAULIFLOWER, ROMAINE AND LE...",3600,4100,3850,2.96,5

In [33]:
pd.read_sql_query('select * from avo_transport', con=engine).head()

,date,origin,destination,transport_distance,commodity,low_weekly_rate,high_weekly_rate,average_weekly_rate,avg_rate_per_mile_ratio,availability_score
0,2015-05-10,South District California,ATLANTA,2100,CITRUS AND AVOCADOS,5200,6000,5550,2.64,3
1,2015-05-10,South District California,BALTIMORE,2600,CITRUS AND AVOCADOS,6500,7300,6650,2.56,3
2,2015-05-10,South District California,BOSTON,2900,CITRUS AND AVOCADOS,7200,7800,7350,2.53,3
3,2015-05-10,South District California,CHICAGO,2030,CITRUS AND AVOCADOS,4500,5200,4850,2.39,3
4,2015-05-10,South District California,DALLAS,1300,CITRUS AND AVOCADOS,4000,4200,4100,3.15,3

In [34]:
pd.read_sql_query('select * from banana_prices', con=engine).head()

         date  price_per_pound  percent_change
0  2016-01-01            0.581            -0.3
1  2016-02-01            0.573            -3.0
2  2016-03-01            0.586            -1.2
3  2016-04-01            0.574            -3.9
4  2016-05-01            0.570            -2.1

In [35]:
pd.read_sql_query('select * from san_diego', con=engine).head()

Empty DataFrame
Columns: [date, temp, rain_1h, rain_3h, snow_1h, snow_3h, weather_description]
Index: []

In [36]:
SDgroup = sanDiegoWeather_df.groupby(['date']).sum()
SDgroup

Empty DataFrame
Columns: [temp, rain_1h, rain_3h, snow_1h, snow_3h]
Index: []

In [37]:
SDgroup2 = SDgroup.reset_index()
SDgroup2

Empty DataFrame
Columns: [date, temp, rain_1h, rain_3h, snow_1h, snow_3h]
Index: []

In [39]:
SDgroup2 = SDgroup2.dropna()

In [40]:
SDgroup2.to_sql(name='san_diego2', con=engine, if_exists='append', index=False)

In [41]:
pd.read_sql_query('select * from san_diego2', con=engine).head()

Empty DataFrame
Columns: [date, temp, rain_1h, rain_3h, snow_1h, snow_3h]
Index: []